# 3. В настольной игре Скрабл каждая буква имеент опеределенную ценность
# В случае с английским алфавитом очки распледеляюся так
# A E I O U L N S T R  - 1 очко. D G - 2 очка. B C M P - 3 очка
# F H V W Y - 4 очка. K - 5 очков. J X - 8 очков. Q Z - 10 очков
# А русские буквы оцениваются так А В Е И Н О Р С Т - 1 очко
# Д К Л М П У - 2 очка. Б Г Ё Ь Я - 3 очка. Й Ы - 4 очка. Ж З Х Ц Ч - 5 очков. Ш Э Ю
# - 8 очков. Ф Щ Ъ - 10 очков. Напишите программу которая вычисляет стоимость введеного
# пользователем слова. Будем считать что на вход подаётся одно слово которое содержит
# либо только русские либо латинские буквы

# ноутбук - 12