# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

# def get_quater(number_quater):
#     if 0 < number_quater < 5:
#         if number_quater == 1:
#             print('x > 0 and y > 0')
#         elif number_quater == 2:
#             print('x < 0 and y > 0')
#         elif number_quater == 3:
#             print('x < 0 and y < 0')
#         elif number_quater == 4:
#             print('x > 0 and y < 0')
#     else:
#         print('number_quater must be in range 1-4')


# for i in range(1,6):
#     get_quater(i)

#  Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
    
#     *Пример:*
    
#     - A (3,6); B (2,1) -> 5,09
#     - A (7,-5); B (1,-1) -> 7,21


# def distance(a, b):
#     return round(((a[0] - b[0])))


# Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
    
#     *Пример:*
    
#     - Для N = 5: 1, -3, 9, -27, 81



#  Для натурального n создать словарь индекс-значение, состоящий из элементов последовательности 3n + 1.
    
#     *Пример:*
    
#     - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}

#  Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.


