# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

# def get_quater(number_quater):
#     if 0 < number_quater < 5:
#         if number_quater == 1:
#             print('x > 0 and y > 0')
#         elif number_quater == 2:
#             print('x < 0 and y > 0')
#         elif number_quater == 3:
#             print('x < 0 and y < 0')
#         elif number_quater == 4:
#             print('x > 0 and y < 0')
#     else:
#         print('number_quater must be in range 1-4')


# for i in range(1,6):
#     get_quater(i)




